## Vocab generated by v2 of the CMU-Cambridge Statistcal
## Language Modeling toolkit.
##
## Includes 1200 words ##
</s>
<s>
a
abate
able
about
abroad
accelerating
accompanied
across
active
activity
advance
advancing
affect
affecting
after
aftermath
afternoon
again
ahead
airflow
alert
aligned
all
allow
allowing
almost
along
already
also
although
amounts
an
and
another
any
apart
appear
approach
approaches
approaching
approximately
are
area
areas
around
arrive
arrived
arriving
as
associated
at
atlantic
awards
away
back
backing
backs
band
bands
banks
be
become
becomes
becoming
before
begin
beginning
begins
best
between
bit
bloody
blustery
books
both
break
breaking
breaks
breeze
breezes
breezy
brief
bright
brighten
brightening
brighter
brightness
bring
bringing
brisk
broken
build
building
builds
bulk
burst
bursts
but
by
calm
can
cause
causing
celsius
centered
central
centre
centres
chance
change
channel
chiefly
chilly
cinema
clear
clearance
cleared
clearer
clearing
clears
close
closer
cloud
clouding
cloudy
coast
coastal
coastline
coasts
coats
cold
colder
coldest
come
coming
completely
complex
conditions
confined
considerably
continental
continue
continues
continuing
continuous
cool
cooler
coolest
could
counties
countries
country
countrywide
county
couple
cover
covering
covers
cross
crosses
crossing
currently
damaging
damp
danger
dark
darkness
data
dawn
day
daybreak
daylight
days
daytime
deal
decline
declines
declining
decrease
decreasing
deep
deepen
deepening
degrees
dense
denser
depression
depressions
derry
develop
developing
develops
die
direction
disappearing
districts
does
dominates
down
downpours
drier
drift
drifting
drifts
driving
drizzle
drizzly
dry
drying
due
dull
during
dying
early
ease
eases
easing
east
easter
easterly
eastern
eastward
edge
edges
edging
eight
eighteen
eleven
elsewhere
embedded
encroaching
end
england
enjoy
error
especially
established
europe
even
evening
eventually
everywhere
except
expect
expected
explosively
exposed
extend
extending
extends
extensive
extra
extreme
extremely
facing
fair
fairly
fall
falling
falls
far
feed
feeding
feel
feeling
ferries
few
field
fifteen
fifty
fill
filling
fills
fine
first
fist
five
flash
flooding
flow
fog
foggy
follow
followed
following
follows
for
force
forecast
form
forming
found
four
fourteen
france
frequent
frequently
fresh
freshen
freshening
fresher
freshest
friday
fringes
from
front
frontal
fronts
frost
frosty
further
gale
gales
general
generally
generating
gentle
georges
give
giving
glimmers
goes
going
good
gradual
gradually
grey
ground
gust
gusting
gusts
gusty
hail
half
harbour
has
have
having
haze
hazy
head
headlines
heavier
heaviest
heavy
here
high
higher
highest
hill
hills
hilly
his
holidays
hook
hour
hours
however
humid
hundred
icy
if
imminent
improve
improvement
improving
in
increase
increased
increases
increasing
increasingly
information
initially
inland
inshore
intense
intensify
intensifying
intervals
into
introducing
ireland
irish
is
islands
isle
isolated
issued
it
it'll
it's
its
jobs
just
keep
keeping
kerry
knots
land
land's
large
largely
last
late
later
lead
leading
leave
leaving
less
lie
lies
lift
lifting
light
lighter
likely
linger
lingering
little
local
localized
locally
located
long
longer
loop
lot
lough
low
lower
lowest
lying
main
mainly
maintain
maintained
maintaining
maintains
man
many
maximum
may
meanwhile
merge
merging
met
meteorological
mid
midday
middle
midland
midlands
midnight
mild
milder
mildest
miles
mind
minimum
mist
misty
mix
mixture
mizen
mod
moderate
moderates
moderating
moist
monday
more
morning
most
mostly
move
moves
moving
mph
much
muggy
murky
music
national
nautical
near
next
night
nightfall
nights
nil
nine
nineteen
no
none
noon
north
northeast
northeasterly
northeastern
northerly
northern
northwest
northwesterly
northwestern
not
now
occasional
occasionally
occlusion
occur
october
odd
of
off
office
offshore
often
on
once
one
ones
only
onshore
onto
operation
or
other
otherwise
our
out
outbreaks
outer
outlook
outside
over
overall
overcast
overland
overnight
page
part
particular
particularly
partly
parts
pass
passes
passing
patches
patchy
per
perhaps
period
periods
persist
persistent
persisting
persists
places
placing
pleasant
plenty
pockets
point
poor
port
positioned
possibility
possible
possibly
preceded
precipitation
predominantly
present
pressure
principally
probably
progresses
prolonged
public
pull
push
pushes
pushing
quickly
quite
racing
radio
rain
rainfall
rainy
range
ranging
rapidly
rather
reach
reaching
recent
recently
reducing
region
regions
relatively
remain
remainder
remaining
remains
replaced
rest
resulting
return
returning
ridge
rise
rises
rising
risk
roads
round
same
sand
saturday
scattered
scattering
sea
seaboard
search
seas
second
see
sell
series
server
set
sets
setting
settled
seven
seventeen
severe
shallow
sharp
sheltered
short
should
shower
showers
significantly
situated
situation
six
sixteen
sixty
skies
slack
slacken
slackening
slackens
slacker
sleet
slight
slow
slowly
small
snow
so
some
sometimes
somewhat
soon
south
southeast
southeastern
souther
southerly
southern
southwest
southwestern
spell
spells
spot
spots
spread
spreading
spreads
squalls
stabilize
stabilizes
stabilizing
stable
stage
stall
start
starting
stationary
stay
staying
steadily
still
store
storm
stormy
strengthen
strengthening
stretches
stretching
strong
stronger
strongest
sun
sunday
sunny
sunrise
sunshine
surrounding
swell
system
systems
television
temperature
temperatures
ten
tend
tending
than
that
the
theatre
them
then
there
these
they
thicken
thickening
thicker
thin
thirteen
this
though
threat
threaten
three
through
throughout
thunder
thunderstorm
thunderstorms
thursday
ties
time
times
timetables
to
today
today's
together
tomorrow
tomorrow's
tonight
tonight's
too
top
touch
touching
towards
track
tracking
tracks
travelling
trough
troughs
tuesday
turn
turning
turns
twelve
twenty
two
ultimately
under
uniform
unsettled
unstable
until
up
us
valid
variable
vary
veer
veering
veers
very
vicinity
vigorous
violent
visibility
wake
wales
wards
warm
warmer
warmest
warning
was
water
waters
wave
waves
way
weak
weaken
weakened
weakening
weakens
weather
wednesday
week
well
west
westerly
western
westwards
wet
what's
when
where
which
while
wide
widespread
will
wind
winds
windy
wing
wins
wintry
with
won't
year
years
zero
zone
